# JoinGeometryUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
JoinGeometryUtils Class
Members See Also
---
Utilities for joining and unjoining elements, and for managing the order in which elements are joined.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static class JoinGeometryUtils
```

Visual Basic
---
```text
Public NotInheritable Class JoinGeometryUtils
```

Visual C++
---
```text
public ref class JoinGeometryUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..JoinGeometryUtils
# See Also
JoinGeometryUtils Members
Autodesk.Revit.DB Namespace